package array;

public class SecretMap {
    public String[] solve(int[] map1, int[] map2){
        /*
        입력된 지도 1과 지도 2를 이용해 전체 지도를 찾는 문제이다.
        지도 1과 지도 2는 가로, 세로 길이가 n이며 0과 1로 이루어져 있는 정사각형 지도이다.
        지도 1과 지도 2는 각각 정수 배열로 암호화되어 있다.
        암호화된 배열은 지도의 각 가로줄에서 벽 부분을 1, 공백 부분을 0으로 부호화 했을 때 얻어지는 이진수에 해당하는 값의 배열이다.
        즉, map1[0]이 9 일 때 2진수로 변환하면 01001이 된다.
        전체 지도는 지도 1과 지도 2를 겹쳐 모두 0인 경우만 전체 지도에서 공백이고, 지도 1과 지도 2 중 하나라도 1(벽)이 있는 경우 벽이다.
        반환하는 값은 전체 지도이며 벽은 #으로 표현하고 공백은 ' '으로 표현한 String 배열을 반환한다.
         */
        return null;
    }
}
